Marks100/STM32_RFM69_receiver/Src/HAL/HAL_UART/HAL_UART.c
				case '3':
					if( ( *result1 == '0' ) || ( strstr(result1, "off") != 0 ) )
					{
					}
					else
					{
					}
					break;

				default:
					SERIAL_Send_data( SERIAL_invalid_cmd_message_s );
					break;
			}
		}
		else if( strstr(strlwr(SERIAL_rx_buf_s), "sleep" ) != 0)
		{
			u32_t val;

			char *result = strstr(SERIAL_rx_buf_s, "sleep") + 6;

			val = atoi(result);

			if( val > 15300 )
			{
				val = 15300;
				sprintf( SERIAL_tx_buf_s, "Selection too high, Max = 15300, using Max instead :)\r\n\r\n" );
				SERIAL_Send_data( SERIAL_tx_buf_s );
			}
			else
			{
				sprintf( SERIAL_tx_buf_s, "Sleep time has been set to %d secs\r\n\r\n", (int)val );
				SERIAL_Send_data( SERIAL_tx_buf_s );

				RTC_set_wakeup_time( val );

				/* change the value and write to NVM */
				NVM_info_s.NVM_generic_data_blk_s.sleep_time = val;
				NVM_request_flush();
			}

		}
		else if( strstr(strlwr(SERIAL_rx_buf_s), "rf" ) != 0)
		{
			u8_t val;

			char *sub_string = strstr(SERIAL_rx_buf_s, "rf") + 3;

			if( ( strstr(sub_string, "conf") != 0 ) )
			{
				sub_string = strstr(SERIAL_rx_buf_s, "rf") + 8;

				val = atoi(sub_string);

				if( val >= RFM69_CFG_MAX )
				{
					sprintf( SERIAL_tx_buf_s, "Selection not valid.. config can be between 0..%d\r\n", RFM69_CFG_MAX );
					SERIAL_Send_data( SERIAL_tx_buf_s );
				}
				else
				{
					NVM_info_s.NVM_generic_data_blk_s.rf_config = (RFM69_static_configuration_et)val;
					NVM_request_flush();

					sprintf( SERIAL_tx_buf_s, "\r\nRf config %d selected\r\n", val );
					SERIAL_Send_data( SERIAL_tx_buf_s );

					/* reset the RF chip so it can use the new settings */
					RFM69_reset();
				}
			}
			else if( ( strstr(sub_string, "tx") != 0 ) )
			{
				*sub_string = strstr(SERIAL_rx_buf_s, "tx") + 3;
			}
			else if( ( strstr(sub_string, "read") != 0 ) )
			{
				u8_t read_data[84];
				u8_t i;

				/* read as many registers as we can in one go */
				RFM69_read_registers( READ_FROM_CHIP_BURST_MODE, REGOPMODE, read_data, ( sizeof( read_data ) - 5 ) );

				RFM69_read_registers( READ_FROM_CHIP, REGTESTLNA, &read_data[80], 1 );

				RFM69_read_registers( READ_FROM_CHIP, REGTESTPA1, &read_data[81], 1 );

				RFM69_read_registers( READ_FROM_CHIP, REGTESTPA2, &read_data[82], 1 );

				RFM69_read_registers( READ_FROM_CHIP, REGTESTDAGC, &read_data[83], 1 );

				RFM69_read_registers( READ_FROM_CHIP, REGTESTAFC, &read_data[84], 1 );

				sprintf( SERIAL_tx_buf_s, "\r\nReading back all RFM69 registers...\r\n" );
				SERIAL_Send_data( SERIAL_tx_buf_s );

				for( i = 0u; i < ( sizeof( read_data ) - 5 ); i++ )
				{
					sprintf( SERIAL_tx_buf_s, "\r\nReg %02d is 0x%02X", i+1, read_data[i] );
					SERIAL_Send_data( SERIAL_tx_buf_s );
				}

				/* Now print all the registers that are not sequential */
				sprintf( SERIAL_tx_buf_s, "\r\nReg %02d is 0x%02X", REGTESTLNA, read_data[80] );
				SERIAL_Send_data( SERIAL_tx_buf_s );

				sprintf( SERIAL_tx_buf_s, "\r\nReg %02d is 0x%02X", REGTESTPA1, read_data[81] );
				SERIAL_Send_data( SERIAL_tx_buf_s );

				sprintf( SERIAL_tx_buf_s, "\r\nReg %02d is 0x%02X", REGTESTPA2, read_data[82] );
				SERIAL_Send_data( SERIAL_tx_buf_s );

				sprintf( SERIAL_tx_buf_s, "\r\nReg %02d is 0x%02X", REGTESTDAGC, read_data[83] );
				SERIAL_Send_data( SERIAL_tx_buf_s );

				sprintf( SERIAL_tx_buf_s, "\r\nReg %02d is 0x%02X", REGTESTAFC, read_data[84] );
				SERIAL_Send_data( SERIAL_tx_buf_s );

				sprintf( SERIAL_tx_buf_s, "\r\n\r\n" );
				SERIAL_Send_data( SERIAL_tx_buf_s );
			}
			else if( ( strstr(sub_string, "fifo") != 0 ) )
			{
				u8_t rfm69_fifo_regs[ RFM69_MAX_DATA_LEN ];
				u8_t i;

				RFM69_read_FIFO_register( rfm69_fifo_regs );

				for( i = 0u; i < RFM69_MAX_DATA_LEN; i++ )
				{
					sprintf( SERIAL_tx_buf_s, "\r\nFifo Reg %02d is %02X", i, rfm69_fifo_regs[i] );
					SERIAL_Send_data( SERIAL_tx_buf_s );
				}

				sprintf( SERIAL_tx_buf_s, "\r\n\r\n" );
				SERIAL_Send_data( SERIAL_tx_buf_s );
			}
			else if( ( strstr(sub_string, "power") != 0 ) )
			{
				sub_string = strstr(SERIAL_rx_buf_s, "rf") + 9;

				val = atoi(sub_string);

				if( val > RFM69_MAX_TX_POWER_LEVEL )
				{
					sprintf( SERIAL_tx_buf_s, "\r\nRF TX power selection %d is not valid\r\nAuto adjusting the RF TX power selection...\r\n", val );
					SERIAL_Send_data( SERIAL_tx_buf_s );

					/* Default them to config */
					val = RFM69_MAX_TX_POWER_LEVEL;
				}

				sprintf( SERIAL_tx_buf_s, "\r\nRF TX power %d selected\r\n", val );
				SERIAL_Send_data( SERIAL_tx_buf_s );

				RFM69_set_PA_level( val );

				NVM_info_s.NVM_generic_data_blk_s.tx_power_level = val;
				NVM_request_flush();

				sprintf( SERIAL_tx_buf_s, "\r\nActual RF TX power read back : 0x%02X \r\n", val );
				SERIAL_Send_data( SERIAL_tx_buf_s );
			}
			else if (( strstr(sub_string, "id") != 0 ) )
			{
				sub_string = strstr(SERIAL_rx_buf_s, "rf") + 6;

				val = atoi(sub_string);
				NVM_info_s.NVM_generic_data_blk_s.node_id = val;
				NVM_request_flush();

				sprintf( SERIAL_tx_buf_s, "\r\nRF node id set to %d \r\n", val );
				SERIAL_Send_data( SERIAL_tx_buf_s );

				//RFM69_set_own_node_address( val );
			}
			else if( ( strstr(sub_string, "test") != 0 ) )
			{
				u8_t i;

				if( RFM69_read_version_num() != RFM69_VERSION )
				{
				   STDC_basic_assert();

				   sprintf( SERIAL_tx_buf_s, "\r\nReading back the RFM69 version number failed....fuck!! :( \r\n" );
				   SERIAL_Send_data( SERIAL_tx_buf_s );
				}
				else
				{
					sprintf( SERIAL_tx_buf_s, "\r\nVersion number check passed\r\nWriting down the RFM69 Register config....\r\n" );
					SERIAL_Send_data( SERIAL_tx_buf_s );
					STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

					/* Fire down a config of registers */
					RFM69_set_configuration( NVM_info_s.NVM_generic_data_blk_s.rf_config );

					u32_t freq;
					freq = RFM69_read_rf_carrier_freq();
					sprintf( SERIAL_tx_buf_s, "\r\nRF carrier frequency is %dHz\r\n", (int)freq );
					SERIAL_Send_data( SERIAL_tx_buf_s );
					STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

					sprintf( SERIAL_tx_buf_s, "\r\nReading back the RFM69 Register config....\r\n" );
					SERIAL_Send_data( SERIAL_tx_buf_s );
					STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

