Marks100/STM32_RFM69_receiver/Src/HAL/HAL_UART/HAL_UART.c
					u8_t read_data[79];
					RFM69_register_data_st write_data[79];

					RFM69_read_registers( READ_FROM_CHIP_BURST_MODE, REGOPMODE, read_data, sizeof( read_data ) );
					RFM69_get_configuration( RFM69_433_DEFAULT_CONFIG, write_data );

					for( i = 0u; i < 79; i++ )
					{
						sprintf( SERIAL_tx_buf_s, "\r\nReg %02d is write:%02X read:%02X", write_data[i].RFM69_register, write_data[i].register_data, read_data[i] );
						SERIAL_Send_data( SERIAL_tx_buf_s );
					}

					sprintf( SERIAL_tx_buf_s, "\r\n\r\n" );
					SERIAL_Send_data( SERIAL_tx_buf_s );
				}
			}
			else if(( strstr(sub_string, "stats") != 0 ) )
			{
				u32_t cnt;
				u32_t time;
				f32_t percent;
				s8_t rssi;

				cnt = RFM69_get_received_packet_cnt();
				time = HAL_TIM_get_time();
				rssi = RFM69_get_last_received_RSSI();
				percent = ( ( (f32_t)cnt / (f32_t)time ) * 100.0f );

				sprintf( SERIAL_tx_buf_s, "\r\nCurrent received packet count:\t\t\t%d", cnt );
				SERIAL_Send_data( SERIAL_tx_buf_s );
				STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

				sprintf( SERIAL_tx_buf_s, "\r\nSeconds elapsed since first frame received:\t%d", time );
				SERIAL_Send_data( SERIAL_tx_buf_s );
				STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

				sprintf( SERIAL_tx_buf_s, "\r\nNo of missed frames:\t\t\t\t%d", ( time - cnt ) );
				SERIAL_Send_data( SERIAL_tx_buf_s );
				STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

				sprintf( SERIAL_tx_buf_s, "\r\nLast received frame RSSI:\t\t\t%d", rssi );
				SERIAL_Send_data( SERIAL_tx_buf_s );
				STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

				sprintf( SERIAL_tx_buf_s, "\r\nPacket reception status:\t\t\t%d%%\r\n", (u8_t)percent );
				SERIAL_Send_data( SERIAL_tx_buf_s );
				STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

				sprintf( SERIAL_tx_buf_s, "\r\nRun time in secs since power-up:\t\t\t%d%\r\n", time );
				SERIAL_Send_data( SERIAL_tx_buf_s );
				STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );
			}
			else
			{
				sprintf( SERIAL_tx_buf_s, "Selection not valid please select \"conf\" or \"tx\"\r\n");
				SERIAL_Send_data( SERIAL_tx_buf_s );
				sprintf( SERIAL_tx_buf_s, "eg conf 0 = loads rf config 0, or others if applicable\r\n");
				SERIAL_Send_data( SERIAL_tx_buf_s );
				sprintf( SERIAL_tx_buf_s, "eg rf tx = triggers a packet of rf to be sent\r\n");
				SERIAL_Send_data( SERIAL_tx_buf_s );
			}
		}
		else if( strncmp(strlwr(SERIAL_rx_buf_s), "rand\r", 5) == 0)
		{
			u16_t random_number;

			/* Set the seed */
			srand( get_counter() );

			/* Grab the now "random :)" number */
			random_number = rand()%100;

			while( random_number == 0 )
			{
				random_number = rand()%100;
			}

			sprintf( SERIAL_tx_buf_s, "Random number:\t%d\r\n\r\n", (int)random_number );
			SERIAL_Send_data( SERIAL_tx_buf_s );
		}
		else if( strstr(strlwr(SERIAL_rx_buf_s), "time" ) != 0)
		{
			u8_t hours;
			u8_t mins;
			u8_t secs;

			char *sub_string = strstr(SERIAL_rx_buf_s, "time") + 5;
			hours = (u8_t)atoi(sub_string);

			*sub_string = strstr(SERIAL_rx_buf_s, "time") + 8;
			mins = (u8_t)atoi(sub_string);

			*sub_string = strstr(SERIAL_rx_buf_s, "time") + 11;
			secs = (u8_t)atoi(sub_string);

			sprintf( SERIAL_tx_buf_s, "\r\nTime has been set to\r\nHours:\t%d\r\nMins:\t%d\r\n\r\nSecs:\t%d", hours, mins, secs );
		}
		else if( strstr(strlwr(SERIAL_rx_buf_s), "nvm" ) != 0)
		{
			sprintf( SERIAL_tx_buf_s, "chksum:\t0x%02X\r\nVers:\t%d\r\nwrites:\t%d\r\nSleep time:\t%d\r\n", NVM_info_s.checksum, NVM_info_s.version,
																										  NVM_info_s.write_count,
																										  NVM_info_s.NVM_generic_data_blk_s.sleep_time );
			SERIAL_Send_data( SERIAL_tx_buf_s );
		}
		else if ( strstr(strlwr(SERIAL_rx_buf_s), "test" ) != 0)
		{

		}
		else
		{
			SERIAL_Send_data( SERIAL_invalid_cmd_message_s );
		}

		SERIAL_clear_RXBuffer();
		SERIAL_clear_TXBuffer();
	}
	else if( SERIAL_stream_mode_s == TRUE )
	{
		if( SERIAL_stream_triggered_s == TRUE )
		{
			SERIAL_stream_triggered_s = FALSE;

			u32_t cnt;
			u32_t time;
			f32_t percent;
			s8_t  rssi;
			u32_t frame_timestamp;

			cnt = RFM69_get_received_packet_cnt();
			time = HAL_TIM_get_time();
			rssi = RFM69_get_last_received_RSSI();
			percent = ( ( (f32_t)cnt / (f32_t)time ) * 100.0f );
			frame_timestamp = RFM69_get_receieved_packet_timestamp();

			sprintf( SERIAL_tx_buf_s, "\r\nCurrent received packet count:\t\t\t%d", cnt );
			SERIAL_Send_data( SERIAL_tx_buf_s );
			STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

			sprintf( SERIAL_tx_buf_s, "\r\nSeconds elapsed since last frame received:\t%d", time - frame_timestamp );
			SERIAL_Send_data( SERIAL_tx_buf_s );
			STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

			sprintf( SERIAL_tx_buf_s, "\r\nNo of missed frames:\t\t\t\t%d", ( time - cnt ) );
			SERIAL_Send_data( SERIAL_tx_buf_s );
			STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

			if( (time - frame_timestamp ) > SERIAL_max_missed_frames_s )
            {
                SERIAL_max_missed_frames_s = ( time - cnt );
            }
            sprintf( SERIAL_tx_buf_s, "\r\nMax missed frames in a row:\t\t\t%d", SERIAL_max_missed_frames_s );
			SERIAL_Send_data( SERIAL_tx_buf_s );
			STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

			sprintf( SERIAL_tx_buf_s, "\r\nLast received frame RSSI:\t\t\t%d", rssi );
			SERIAL_Send_data( SERIAL_tx_buf_s );
			STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

			sprintf( SERIAL_tx_buf_s, "\r\nPacket reception status:\t\t\t%d%%\r\n", (u8_t)percent );
			SERIAL_Send_data( SERIAL_tx_buf_s );
			STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );

			sprintf( SERIAL_tx_buf_s, "\r\nRun time in secs since power-up:\t\t%d%\r\n", time );
            SERIAL_Send_data( SERIAL_tx_buf_s );
            STDC_memset( SERIAL_tx_buf_s, 0x20, sizeof( SERIAL_tx_buf_s ) );
		}
	}
}




/*!
****************************************************************************************************
*
*   \brief         Writes a buffer of information out to UART
*
*   \author        MS
*
*   \return        none
*
***************************************************************************************************/
void SERIAL_Send_data(const char *pucBuffer)
{
    while (*pucBuffer)
    {
        USART_SendData(USART2, *pucBuffer);
        while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET)
        {
        }
        pucBuffer += 1;
    }
}



void SERIAL_clear_RXBuffer(void)
{
	for ( SERIAL_rx_buf_idx_s = 0; SERIAL_rx_buf_idx_s < RX_BUF_SIZE; SERIAL_rx_buf_idx_s++ )
	{
		SERIAL_rx_buf_s[SERIAL_rx_buf_idx_s] = '\0';
	}
	SERIAL_rx_buf_idx_s = 0;
}



void SERIAL_clear_TXBuffer(void)
{
	char i = 0;
	for ( i = 0; i < TX_BUF_SIZE; i++ )
	{
		SERIAL_tx_buf_s[i] = '\0';
	}
}




void SERIAL_trigger_stream_output( void )
{
	SERIAL_stream_triggered_s = TRUE;
}


//
///***************************************************************************************************
//**                              ISR Handlers                                                      **
//***************************************************************************************************/
void USART2_IRQHandler(void)
{
    if ((USART2->SR & USART_FLAG_RXNE) != (u16)RESET)
	{
		SERIAL_rx_buf_char_s = USART_ReceiveData(USART2);
		SERIAL_rx_buf_s[SERIAL_rx_buf_idx_s] = SERIAL_rx_buf_char_s;
		SERIAL_rx_buf_idx_s++;

		if(SERIAL_rx_buf_char_s == '\b' )
		{
			if (SERIAL_rx_buf_idx_s > 0u )
			{
				SERIAL_rx_buf_idx_s -= 2;
			}
		}
		else if (SERIAL_rx_buf_char_s != '\r')
		{
			if (SERIAL_rx_buf_idx_s >= RX_BUF_SIZE)
			{
				SERIAL_Send_data( SERIAL_buffer_reset_message_s );
				SERIAL_clear_RXBuffer();
			}
		}
		else
		{
			SERIAL_cr_received_s = TRUE;
		}

		//Echo
		SERIAL_Send_data( &SERIAL_rx_buf_char_s );
	}
}


///****************************** END OF FILE *******************************************************/
